app/views/users/show.html.erb

	<li class="<%= 'active' if params[:tab].nil? || params[:tab] == 'posts' %>">
		<%= link_to "Posts (#{@user.posts.size})", user_path(@user, tab: 'posts') %>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 4]]

	<li class="<%= 'active' if params[:tab] == 'comments' %>">
		<%= link_to "Comments (#{@user.comments.size})", user_path(@user, tab: 'comments') %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 4]]