app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 14 Oct 2015 14:52:15 UTC +00:00], ["name", "Books"], ["updated_at", Wed, 14 Oct 2015 14:52:15 UTC +00:00]]