app/controllers/categories_controller.rb

  def show
    @category = Category.find_by slug: params[:id]
---
SELECT "categories".* FROM "categories" WHERE "categories"."slug" = 'books' LIMIT 1