app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = Comment.new(params.require(:comment).permit(:body))
    @comment.post = @post
    @comment.user = current_user

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Third."], ["created_at", Mon, 19 Oct 2015 14:29:34 UTC +00:00], ["post_id", 1], ["updated_at", Mon, 19 Oct 2015 14:29:34 UTC +00:00], ["user_id", 1]]

  def vote
    comment = Comment.find(params[:id])
    vote = Vote.create(voteable: comment, user: current_user, vote: params[:vote])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "6"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 21 Oct 2015 14:22:13 UTC +00:00], ["updated_at", Wed, 21 Oct 2015 14:22:13 UTC +00:00], ["user_id", 4], ["vote", true], ["voteable_id", 6], ["voteable_type", "Comment"]]