app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "posts" ("created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Fri, 02 Oct 2015 18:00:26 UTC +00:00], ["title", "sdfs"], ["updated_at", Fri, 02 Oct 2015 18:00:26 UTC +00:00], ["url", "dfs"]]
---
  def create
    @post = Post.new(post_params)
    @post.user = User.first # TODO: change once we have authentication

    if @post.save

UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "My First Post!"], ["updated_at", Tue, 13 Oct 2015 17:28:02 UTC +00:00]]
---
  def update
    if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 12]]
---
  def set_post
    @post = Post.find(params[:id])