app/controllers/posts_controller.rb

INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 21 Oct 2015 13:51:03 UTC +00:00], ["updated_at", Wed, 21 Oct 2015 13:51:03 UTC +00:00], ["user_id", 4], ["vote", true], ["voteable_id", 12], ["voteable_type", "Post"]]
---
  def vote
    @vote = Vote.create(voteable: @post, user: current_user, vote: params[:vote])

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'waking-life' LIMIT 1
---
  def set_post
    @post = Post.find_by slug: params[:id]