app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("password_digest", "username") VALUES (?, ?)  [["password_digest", "$2a$10$VG9PIr2et9/yYLgw2/KWYuCCZ2cAY5UPrc1uUhy/H0rjHh924el6q"], ["username", "Philip"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "time_zone" = ? WHERE "users"."id" = 3  [["password_digest", "$2a$10$aclcDNvEY/0VCcaUYj8oVO85REsxH3X1ZKk2g7BVAhC6khGP/ZzmK"], ["time_zone", "Eastern Time (US & Canada)"]]