app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."slug" = 'gandalf' LIMIT 1
---
  def set_user
    @user = User.find_by slug: params[:id]