app/views/categories/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "categories_posts" ON "posts"."id" = "categories_posts"."post_id" WHERE "categories_posts"."category_id" = ?  [["category_id", 2]]
---

<% @category.posts.each do |post| %>